In [2]:
import numpy as np
import pandas as pd

In [3]:
a1 = [1,'송준기', 680]
a11= [1,'송준기', 680]
b1 = [1,'권보아', 880]
c1 = [2,'김나현', 620]
d1 = [2,'송준기', 750]
e1 = [3,'김나현', 750]
f1 = [3,'박효신', 920]
g1 = [3,'진달개', 850]
df = pd.DataFrame([a1, a11, b1, c1, d1, e1, f1, g1], columns=['회차', '이름', '점수'])

In [4]:
df.unique('이름')

   회차   이름   점수
0   1  송준기  680
1   1  송준기  680
2   1  권보아  880
3   2  김나현  620
4   2  송준기  750
5   3  김나현  750
6   3  박효신  920
7   3  진달개  850

In [6]:
df[df.duplicated('이름')]
# 위 값부터 scan해서 이전에 있던 값이 다시 반복 출형하는 경우는 True

   회차   이름   점수
1   1  송준기  680
4   2  송준기  750
5   3  김나현  750

In [36]:
iter = tuple(sorted(set(df['이름'].to_list())))
# Serie를 list로 전환하고, 중복을 제거하고, 정렬하고, 최종적으로 tuple을 만든다
# 근데 방법이 이거 밖에 없나?
# 한가지 더 set은 index를 쓸 수 없고, 따라서 정렬을 보장하지 않는다(순서없음).   💢
# 정렬을 원한다면 set이후에 sorted()를 사용하면 정렬된 list를 얻는다.
# tuple은 index를 사용할 수 있다.

for i in iter:
    print(i)

권보아
김나현
박효신
송준기
진달개

In [ ]:
# tuple : immutable(for fixed data) 
# indexable(can apply almost every list method except capable of changing elements) 

# set : no_duplicate(중복검사에 특화), mutable, not_indexable  
# (available : add, pop, intersection, difference, union)(not available: +, append)

In [40]:
set1 ={ 1, 2, 3}
set2 = {2, 3, 4, 5}
set1.pop(2)

TypeError: set.pop() takes no arguments (1 given)

In [27]:
sorted(df['이름'].drop_duplicates())
# sorted()는 list를 return한다. 따라서 위에서 to_list()를 쓸 필요가 없다.

['권보아', '김나현', '박효신', '송준기', '진달개']

In [13]:
df.drop_duplicates('이름', keep=False).reset_index(drop=True)
# keep {'first', 'last', False} False는 중복이 있는 모든 행을 삭제한다.

   회차   이름   점수
0   1  권보아  880
1   3  박효신  920
2   3  진달개  850